import React from 'react';
import './Article.css'

const Article = () => {
    return (
        <div className='article-container'>
            <div className='article-left'>
                <h1>How React Works ?</h1>
                <p className='article-paragraph'>রিয়্যাক্ট হলো বর্তমান সময়ের সবচেয়ে জনপ্রিয়, ফেক্সিবল, কার্যকরি এবং ওপেন সোর্স জাবস্ক্রিপ্ট লাইব্রেরি। বেইসিক্যালি রিয়্যাক্ট আমাদের রিয়েল ডমকে কপি করে সেটা একটা ভার্চুয়াল ডমে কনভার্ট করে তার কাছে রাখে। তারপর যখন আমাদের রিয়েল ডমের কোনো এলিমেন্ট চেইঞ্জ হয় সেটাকে সে তার ভার্চুয়াল ডমের সাথে কম্পেয়ার করে আইডেন্টিফাই করে দেখে রিয়েল ডমের কোন কোন এলিমেন্টটা চেইঞ্জ হবে।  তারপর সে সেই সেই এলিমেন্টকে রিরেন্ডার করে। এর জন্য তাকে সমস্ত ডমকে রিরেন্ডার করতে হয় না। যার ফলে সে খুব দ্রুত রিয়েল ডমের মধ্যে চেইঞ্জ আনতে পারে। আর এই পুরো প্রক্রিয়াটি চলে রিয়্যাক্টের একটি কার্যকরি এলগোরিদম এর মাধ্যমে। যাকে বলে ডিফিং এলগোরিদম।</p>
            </div>
            <div className='article-right'>
                <h1>How useState Works ?</h1>
                <p className='article-paragraph'>ইউজ স্টেইট হলো রিয়্যাক্ট এর একটি কার্যকরি হুক বা ডিসপ্যাচার। এটি আমাদেরকে ফাংশনাল কম্পোনেন্ট এ স্টেইট ভ্যারিয়েবল (যেই ভ্যারিয়েবলটি চেইঞ্জ হতে পারে) রাখতে দেয়। মূলত হুক বলতে বুঝায় রিয়্যাক্টের কিছু স্পেশাল ফাংশনকে; যেটা রিয়্যাক্টা এর কিছু কিছু ফাংশনালিটিকে এপ্লিমেন্ট করে দেয়। যাতে সে কোডগুলোকে ইজিলি অপটিমাইজ করতে পারে।
                </p>
                <p>ইউজ স্টেইট আমাদের একটা ভ্যালু এবং একটা সেটার ফাংশন রিটার্ন করে। এটি সেটার ফাংশনের মাধ্যমে আমাদের স্টেইট ভ্যালুটাকে চেইঞ্জ করার অনুমতি দেয়। এবং স্টেইট এর ভ্যালু কখনো চেইঞ্জ হলে প্রত্যেকবার সে যেই যেই কম্পোনেন্টে ব্যবহৃত হয়েছে সেই সেই কম্পোনেন্টে চলে যায় রিরেন্ডার হওয়ার জন্য। এবং ফাইনালি সে তার ভার্চুয়াল ডমের সাহায্য আমাদের রিয়েল ডমকে রিরেন্ডার করে থাকে।
                </p>
            </div>
        </div>
    );
};

export default Article;